examples/batchMode/taurusWorker/test.yml
settings:
  artifacts-dir: artifacts
  check-interval: 10

execution:
- concurrency: 6
  ramp-up: 1m
  hold-for: 1m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - https://loadtest-target.neocortix.com

modules:
  console:
    disable: true
  consolidator:
    min-buffer-len: 8s

services:
- module: monitoring
  ~local:
  - disable: true
  - metrics:
    - cpu
    - mem